src/cf/DataProcessors/РабочееМестоКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоКассира</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидОперацииРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассаККМРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НалогообложениеНДСРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассирРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДисконтнаяКартаРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗаказПокупателяРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументРасчетаРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияСДенежнымиСредствами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецПодарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьПодарокВЧек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗаказПокупателяРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПродавца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСерий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_3РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_3РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеобходимостьВводаКодаМаркировки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеобходимостьВводаСерии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПартияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подарок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПродавецРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число5_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число5_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СистемаНалогообложения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипыСистемНалогообложенияККТРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтавкаНДСРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НеотрицательноеЧисло15_2_РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НеотрицательноеЧисло15_2_РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НеотрицательноеЧисло15_2_РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиНаценки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидкиОплатыБонусом</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УпаковкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеВариантУчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВариантУчетаЧастичногоВыбытияРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеНоменклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеХарактеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЯчейкаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимИдентификаторЗапросаГИСМТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимДатаЗапросаГИСМТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбытиеБутылки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Патент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПатентРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимИдентификаторЭкземпляраПО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимВерсияБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВидОплатыРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭквайринговыйТерминалРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число7_4РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Число15_2РМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСертификата</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерСертификатаРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлатежнойСистемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСпособаОплатыЭТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/РабочееМестоКассира/Forms/ФормаАвторизации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	ПараметрыОткрытияФормы = Неопределено;
	ПользовательПоУмолчанию = Пользователи.ТекущийПользователь();
	НастроитьФормуПоВходнымПараметрам();
	Если РежимВхода Или РежимСмены Тогда
		НастроитьДоступностьСозданияКодаДоступа();
	КонецЕсли;
	НастроитьТиповыеГорячиеКлавиши();
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПараметрыОткрытияФормы = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ЗакрытьПриложениеПриОшибке", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,
			ПараметрыОткрытияФормы.ТекстСообщения, ,
			ПараметрыОткрытияФормы.ТекстЗаголовка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" Тогда
		Если ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			ВыполнитьПоискПоШтрихкоду(Штрихкод);
			
		ИначеЕсли ИмяСобытия = "ScanDataBase64" Тогда
			
			Штрихкод = "";
			ШтрихкодBase64 = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			МенеджерОборудованияРМККлиентСервер.Base64ВШтрихкод(ШтрихкодBase64, Штрихкод);
			ВыполнитьПоискПоШтрихкоду(Штрихкод);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			ВыполнитьПоискПоШтрихкоду(Параметр[0]);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ОбщегоНазначенияРМККлиент.ИспользоватьВнешнееСобытие() И ВводДоступен() Тогда
		
		ОбрабатываемыеСобытия = Новый Массив;
		ОбрабатываемыеСобытия.Добавить("Штрихкод");
		ОбрабатываемыеСобытия.Добавить("ПолученШтрихкод");
		ОбрабатываемыеСобытия.Добавить("ScanData");
		ОбрабатываемыеСобытия.Добавить("TracksData");
		ОбрабатываемыеСобытия.Добавить("ДанныеКарты");
		
		Если Не ОбрабатываемыеСобытия.Найти(Событие) = Неопределено Тогда
			ВыполнитьПоискПоШтрихкоду(Данные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТорговыйОбъектДляВходаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТорговыйОбъектДляВхода) Тогда
		ТекущийЭлемент = Элементы.КассирДляВхода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КассирДляВходаОткрытие(Элемент, СтандартнаяОбработка)
	
	ЕстьПравоПросмотра = Ложь;
	ПроверитьДоступностьПросмотраСотрудников(ЕстьПравоПросмотра);
	СтандартнаяОбработка = ЕстьПравоПросмотра;
	
КонецПроцедуры

&НаКлиенте
Процедура КассирДляВходаПриИзменении(Элемент)
	
	КассирПриИзмененииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура КассирДляВходаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СобытиеПереопределено = Ложь;
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуВыбораКассира(ЭтотОбъект, СобытиеПереопределено);
	Если СобытиеПереопределено Тогда
		Возврат;
	КонецЕсли;
		
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборКассираЗавершение", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
	ПараметрыОткрытияФормы.Вставить("РежимКассыСамообслуживания", РежимКассыСамообслуживания);
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВыбораПерсонала", ПараметрыОткрытияФормы, ЭтотОбъект,,,,
		ОбработкаОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговыйОбъектДляВходаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияРМККлиентПереопределяемый.ОткрытьФормуВыбораТорговогоОбъекта(ЭтотОбъект, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Войти(Команда)
	ОбработатьКомандуВойти();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВвод(Команда)
	ОбработатьКомандуОтменитьВвод();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданияКодаДоступа(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Кассир", КассирДляВхода);
	ПараметрыОткрытия.Вставить("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
	
	ДополнительныйПараметрЗакрытияФормы = Новый Структура();
	ДополнительныйПараметрЗакрытияФормы.Вставить("КодДоступа", Неопределено);
	
	Оповещение = Новый ОписаниеОповещения("СозданиеКодаДоступаЗавершение", ЭтотОбъект,
		ДополнительныйПараметрЗакрытияФормы);
	
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаУстановкиКодаДоступаКассира",
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор, , ,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЦифраУниверсальнаяКлавиатура(Команда)
	ОбработатьЦифруЦифровойКлавиатуры(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыОчистить();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьПоследнееУниверсальнаяКлавиатура(Команда)
	ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее();
КонецПроцедуры

&НаКлиенте
Процедура ГорячаяКлавишаEnter(Команда)
	
	ОбработатьГорячуюКлавишуEnter();
	
КонецПроцедуры

&НаКлиенте
Процедура ГорячаяКлавишаESC(Команда)
	
	ОбработатьКомандуОтменитьВвод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СозданиеКодаДоступаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПрерватьСозданиеКодаДоступа = Результат = Неопределено
		И ((ДополнительныеПараметры = Неопределено)
		ИЛИ (ЗначениеЗаполнено(ДополнительныеПараметры)
		И НЕ ОбщегоНазначенияРМККлиентСервер.ЕстьСвойство(ДополнительныеПараметры, "КодДоступа")
		ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры.КодДоступа)));
		
	Если ПрерватьСозданиеКодаДоступа Тогда
		Возврат;
	КонецЕсли;
	
	КодКассира = ?(ЗначениеЗаполнено(Результат), Результат, ДополнительныеПараметры.КодДоступа);
	УстановитьДоступностьЭлементаФормы(Элементы.ОткрытьФормуСозданияКодаДоступа, НЕ ЗначениеЗаполнено(КодКассира));
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВходнымПараметрам()
	
	ВозможныеНазначенияАвторизации = ИнтерфейсРМКСлужебныйКлиентСервер.НазначенияАвторизации();
	Если Параметры.Свойство("ТорговыйОбъект") Тогда
		ТорговыйОбъектДляВхода = Параметры.ТорговыйОбъект;
	КонецЕсли;
	Если Параметры.Свойство("Кассир") Тогда
		КассирДляВхода = Параметры.Кассир;
	КонецЕсли;
	РежимКассыСамообслуживания = Параметры.РежимКассыСамообслуживания;
	НастроитьКассировДляВхода = Параметры.НастроитьКассировДляВхода;
	НазначениеАвторизации = Параметры.НазначениеАвторизации;
	НеобходимоеПраво = Параметры.НеобходимоеПраво;
	НаименованиеПользователяПриЗапросеПрав = Параметры.НаименованиеПользователяПриЗапросеПрав;
	Если Параметры.ИспользоватьЦифровуюКлавиатуру Тогда
		Элементы.ДекорацияИзображениеКартыДоступа.Видимость = Ложь;
		Элементы.ДекорацияИзображениеКартыДоступаМини.Видимость = Истина;
		Элементы.ДекорацияЗаголовокВводКассира.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
		Элементы.ДекорацияЗаголовокВводКассира.Ширина = 35;
		
		ВидыКлавиатуры = ИнтерфейсРМКСлужебный.ВидыЦифровойКлавиатуры();
		ПараметрыПостроения = Новый Структура();
		ПараметрыПостроения.Вставить("ВидКлавиатуры", ВидыКлавиатуры.Авторизация);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиГоризонтальный", ИнтервалМеждуЭлементамиФормы.Двойной);
		ПараметрыПостроения.Вставить("ИнтервалМеждуКлавишамиВертикальный", ИнтервалМеждуЭлементамиФормы.Половинный);
		ПараметрыПостроения.Вставить("РастягиватьПоШирине", Истина);
		ПараметрыПостроения.Вставить("ЦветКнопок", ЦветаСтиля.Палитра85ГолубойРМК);
		
		ИнтерфейсРМКСлужебный.ПостроитьПанельЦифровойКлавиатуры(ЭтотОбъект, Элементы.ГруппаЦифроваяПанель,
			ПараметрыПостроения);
	КонецЕсли;
	
	РежимВхода = (НазначениеАвторизации = ВозможныеНазначенияАвторизации.ОткрытиеФормы
		Или НазначениеАвторизации = ВозможныеНазначенияАвторизации.ПринудительнаяСменаКассира);
		
	РежимСмены = (НазначениеАвторизации = ВозможныеНазначенияАвторизации.СменаКассира
		Или НазначениеАвторизации = ВозможныеНазначенияАвторизации.СменаМагазина);
		
	Если НазначениеАвторизации = ВозможныеНазначенияАвторизации.СменаКассира И ИспользуетсяТорговыйОбъект Тогда
		Элементы.ТорговыйОбъектДляВхода.Доступность = Ложь;
	КонецЕсли;
	Если НазначениеАвторизации = ВозможныеНазначенияАвторизации.ПовышениеПрав
			Или НазначениеАвторизации = ВозможныеНазначенияАвторизации.СлужебныеДействияКСО Тогда
			
		Если ИспользуетсяТорговыйОбъект Тогда
			Элементы.ГруппаВыборМагазинаДляВхода.Видимость = Ложь;
		КонецЕсли;
		Элементы.ГруппаВыборКассираДляВхода.Видимость = Ложь;
		
	КонецЕсли;
	УстановитьЗаголовкиФормы(ВозможныеНазначенияАвторизации);

	НастроитьТипПоляВводаКассира();
	Элементы.ОткрытьФормуСозданияКодаДоступа.Видимость = ((РежимСмены Или РежимВхода) И Не РежимКассыСамообслуживания);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиФормы(ВозможныеНазначенияАвторизации)

	Если НазначениеАвторизации = ВозможныеНазначенияАвторизации.СменаКассира Тогда
		Заголовок = НСтр("ru = '    Смена кассира'");
	ИначеЕсли НазначениеАвторизации = ВозможныеНазначенияАвторизации.СменаМагазина Тогда
		Заголовок = НСтр("ru = '    Смена магазина'");
	ИначеЕсли НазначениеАвторизации = ВозможныеНазначенияАвторизации.ПовышениеПрав Тогда
		УстановитьЗаголовокВводаКассираПриПовышенииПрав();
		Если НеобходимоеПраво = "ПравоЧекКоррекцииРМК" Тогда
			Заголовок = НСтр("ru='    Коррекция'");
		Иначе
			Заголовок = НСтр("ru='    Возврат продажи'");
		КонецЕсли;
	ИначеЕсли НазначениеАвторизации = ВозможныеНазначенияАвторизации.СлужебныеДействияКСО Тогда
		УстановитьЗаголовокВводаКассираДляДействийКСО();
		Заголовок = НСтр("ru = '    Настройки КСО'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьСозданияКодаДоступа()
	
	ПустаяСтрока = НСтр("ru = ''");
	ТекстЗаголовка = ПустаяСтрока;
	ТекстСообщения = ПустаяСтрока;
	ОшибкаЗапуска = ПустаяСтрока;
	ДанныеПроверки = Новый Структура("ТекстЗаголовка,ТекстСообщения,ОшибкаЗапуска",
		ТекстЗаголовка, ТекстСообщения, ОшибкаЗапуска);
		
	Отказ = Ложь;
	ОбщегоНазначенияРМКПереопределяемый.ПроверитьНастройкиПользователя(Отказ,
		ДанныеПроверки.ТекстЗаголовка, ДанныеПроверки.ТекстСообщения);
	Если Отказ Тогда
		
		ПараметрыОткрытияФормы = Новый Структура();
		ПараметрыОткрытияФормы.Вставить("ТекстЗаголовка", ДанныеПроверки.ТекстЗаголовка);
		ПараметрыОткрытияФормы.Вставить("ТекстСообщения", ДанныеПроверки.ТекстСообщения);
		ПараметрыОткрытияФормы.Вставить("ОшибкаЗапуска", ДанныеПроверки.ОшибкаЗапуска);
		
	Иначе
		
		ДанныеПоискаКассира = Новый Структура();
		ДанныеПоискаКассира.Вставить("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
		ДанныеПоискаКассира.Вставить("КассирДляВхода", КассирДляВхода);
	
		КодДоступаУказан = ИнтерфейсРМКСлужебный.КодДоступаПользователяУказан(ДанныеПоискаКассира);
		ДоступностьКоманды = Не КодДоступаУказан И ЗначениеЗаполнено(КассирДляВхода);
		УстановитьДоступностьЭлементаФормы(Элементы.ОткрытьФормуСозданияКодаДоступа, ДоступностьКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементаФормы(Элемент, Доступность)
	Элемент.Доступность = Доступность;
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступностьПросмотраСотрудников(ЕстьПравоПросмотра)
	ОбщегоНазначенияРМКПереопределяемый.ПроверитьДоступностьПросмотраСотрудников(ЕстьПравоПросмотра);
КонецПроцедуры

&НаКлиенте
Процедура КассирПриИзмененииКлиент()
	
	НастроитьДоступностьСозданияКодаДоступа();
	Если ЗначениеЗаполнено(КассирДляВхода) Тогда
		ТекущийЭлемент = Элементы.КодКассира;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКассираЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КассирДляВхода = РезультатВыполнения;
	КассирПриИзмененииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТорговыйОбъектЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТорговыйОбъектДляВхода = РезультатВыполнения;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЦифруЦифровойКлавиатуры(ИмяКомандыКлавиатуры)

	СимволКлавиатуры = ИнтерфейсРМКСлужебныйКлиент.ПолучитьСимволКоманды(ИмяКомандыКлавиатуры);
	ИнтерфейсРМКСлужебныйКлиент.ВставитьСимволыВРедактируемоеПоле(ЭтотОбъект, Элементы.КодКассира,
		СимволКлавиатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыОчистить()
	ИнтерфейсРМКСлужебныйКлиент.ОчиститьТекстРедактированияВПолеФормы(ЭтотОбъект, Элементы.КодКассира);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуЦифровойКлавиатурыУдалитьПоследнее()
	ИнтерфейсРМКСлужебныйКлиент.УдалитьСимволыВРедактируемомПоле(ЭтотОбъект, Элементы.КодКассира, Символы.НПП);
КонецПроцедуры

&НаСервере
Процедура НастроитьТиповыеГорячиеКлавиши()
	
	СочетаниеКлавишESC = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,27,0}}");
	Если НЕ СочетаниеКлавишESC = Неопределено Тогда
		Команды.ГорячаяКлавишаESC.СочетаниеКлавиш = СочетаниеКлавишESC;
	КонецЕсли;
	
	СочетаниеКлавишиEnter = ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,{0,13,0}}");
	Если Не СочетаниеКлавишиEnter = Неопределено Тогда
		Элементы.ГорячаяКлавишаEnter.СочетаниеКлавиш = СочетаниеКлавишиEnter;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуВойти()
	
	Если ЗначениеЗаполнено(КодКассира) Тогда
		ВыполнитьПоискКассира(КодКассира);
	Иначе
		ТекущийЭлемент = Элементы.КодКассира;
		ВывестиСообщениеОбОшибкеАвторизации("ПустойКод");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуОтменитьВвод()
	
	РежимОсновногоОкна = КлиентскоеПриложение.ПолучитьРежимОсновногоОкна();
	
	РежимСтартовогоОкна = (РежимОсновногоОкна = РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто
		Или РежимОсновногоОкна = РежимОсновногоОкнаКлиентскогоПриложения.Киоск
		Или ЭтоНачальноеОкноРядовогоПользователя());
	
	Если РежимВхода И РежимСтартовогоОкна Тогда
		ЗапроситьПодтверждениеЗавершения();
	Иначе
		ИнтерактивноеЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоНачальноеОкноРядовогоПользователя()
	
	Возврат (ВладелецФормы.Окно.НачальнаяСтраница И Не ЭтоПолноправныйПользователь);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПользовательИмеетНеобходимоеПраво(Знач ВыбранныйПользователь, Знач ПроверяемоеПраво)
	
	РезультатФункции = Истина;
	
	Если ЗначениеЗаполнено(ПроверяемоеПраво) Тогда
		
		СтруктураОбъект = Новый Структура("ПользовательБД", ВыбранныйПользователь);
		КонтекстПрав = Новый Структура();
		КонтекстПрав.Вставить("Объект", СтруктураОбъект);
		КонтекстПрав.Вставить("СписокРолейПользователя", Новый СписокЗначений);
		КонтекстПрав.Вставить("ЗапускатьОбменИзИнтерфейсаРМК", Ложь);
		ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуРолейПользователя(КонтекстПрав);
		
		Если КонтекстПрав.СписокРолейПользователя.НайтиПоЗначению(ПроверяемоеПраво) = Неопределено Тогда
			РезультатФункции = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ВернутьДанныеАвторизации(РезультатПоиска)
	
	НайденныйКассир = Неопределено;
	Если РезультатПоиска.Свойство("НайденныйКассир") И Не РезультатПоиска.НайденныйКассир = Неопределено Тогда
		НайденныйКассир = РезультатПоиска.НайденныйКассир;
	Иначе
		ЗаполнитьДанныеНайденногоКассира(РезультатПоиска, НастроитьКассировДляВхода, НайденныйКассир);
	КонецЕсли;
	
	ВозможныеНазначенияАвторизации = ИнтерфейсРМКСлужебныйКлиентСервер.НазначенияАвторизации();
	ЭтоПовышениеПрав = (НазначениеАвторизации = ВозможныеНазначенияАвторизации.ПовышениеПрав
			Или НазначениеАвторизации = ВозможныеНазначенияАвторизации.СлужебныеДействияКСО);
	Если ЕстьНеобходимыеДанныеКассира(НайденныйКассир, ЭтоПовышениеПрав) Тогда
		
		ПользовательБД = ПользовательПоУмолчанию;
		Если НайденныйКассир.Свойство("ПользовательБД") Тогда
			ПользовательБД = НайденныйКассир.ПользовательБД;
		КонецЕсли;
		
		Если ПользовательИмеетНеобходимоеПраво(ПользовательБД, НеобходимоеПраво) Тогда
		
			Ответ = Новый Структура();
			Ответ.Вставить("ТорговыйОбъект", ТорговыйОбъектДляВхода);
			Ответ.Вставить("Кассир", НайденныйКассир.Кассир);
			Ответ.Вставить("ПользовательБД", ПользовательБД);
			Ответ.Вставить("ИспользуетсяТорговыйОбъект", ИспользуетсяТорговыйОбъект);
			
			ИнтерактивноеЗакрытие = Истина;
			Закрыть(Ответ);
			
		Иначе
			
			ВывестиСообщениеОбОшибкеАвторизации("НедостаточноПрав");
			
		КонецЕсли;
		
	Иначе
		
		ВывестиОшибкуАвторизации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуИзПолногоСписка(ЗначенияПоиска, ВыбранныйВладелец)
	
	РезультатФункции = Неопределено;
	КоличествоЗначений = Значенияпоиска.Количество();
	ИндексЗначения = 0;
	Пока ИндексЗначения < КоличествоЗначений И РезультатФункции = Неопределено Цикл
		ДанныеЗначения = ЗначенияПоиска.Получить(ИндексЗначения);
		Если ДанныеЗначения.Владелец = ВыбранныйВладелец Тогда
			РезультатФункции = ДанныеЗначения;
		КонецЕсли;
		ИндексЗначения = ИндексЗначения + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИсключитьПользователейБезКассиров(НастроитьКассировДляВхода, ЗначенияПоиска, ЭтоПовышениеПрав)
	
	КоличествоЗначений = ЗначенияПоиска.Количество();
	ИндексЗначения = 0;
	Пока ИндексЗначения < КоличествоЗначений Цикл
		ТекущийИндекс = КоличествоЗначений - ИндексЗначения - 1;
		ДанныеЗначения = ЗначенияПоиска.Получить(ТекущийИндекс);
		НайденныйКассир = Неопределено;
		ЗаполнитьДанныеНайденногоКассира(ДанныеЗначения, НастроитьКассировДляВхода, НайденныйКассир);
		Если ЕстьНеобходимыеДанныеКассира(НайденныйКассир, ЭтоПовышениеПрав) Тогда
			ДанныеЗначения.Вставить("НайденныйКассир", НайденныйКассир);
		Иначе
			ЗначенияПоиска.Удалить(ТекущийИндекс);
		КонецЕсли;
		
		ИндексЗначения = ИндексЗначения + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОшибкуАвторизации()
	
	Если ЗначениеЗаполнено(КассирДляВхода) Тогда
		ДополнительныеПараметры = Новый Структура();
		ОбщегоназначенияРМККлиент.ЗаполнитьДополнительныеПараметрыПроверкиКодаАвторизаци(ЭтотОбъект,
			ДополнительныеПараметры);
		Если СуществуетКодАвторизацииУКассира(КассирДляВхода, ДополнительныеПараметры) Тогда
			ВывестиСообщениеОбОшибкеАвторизации("НеВерныйКод");
		Иначе
			ВывестиСообщениеОбОшибкеАвторизации("НеУстановленКод");
		КонецЕсли;
	Иначе
		ВывестиСообщениеОбОшибкеАвторизации("НеОпределенКассир");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеНайденногоКассира(РезультатПоиска, НастроитьКассировДляВхода, НайденныйКассир)
	
	РеквизитыФормы = Новый Структура("ИмяФормы", "ФормаАвторизации");
	
	Если НастроитьКассировДляВхода Тогда
		СтруктураПоискаШтрихкода = Новый Структура("Кассир, КодДоступа", РезультатПоиска.Владелец, РезультатПоиска.Штрихкод);
		ШтрихкодированиеРМКПереопределяемый.ЗаполнитьКассираДляВхода(СтруктураПоискаШтрихкода, НайденныйКассир);
	КонецЕсли;
	Если НайденныйКассир = Неопределено Тогда
		ШтрихкодированиеРМКПереопределяемый.ЗаполнитьДанныеНайденногоКассира(РезультатПоиска.Владелец,
			РеквизитыФормы, НайденныйКассир);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьГорячуюКлавишуEnter()
	
	Если ТекущийЭлемент = Элементы.ТорговыйОбъектДляВхода Тогда
			ТекущийЭлемент = Элементы.КассирДляВхода;
		ИначеЕсли ТекущийЭлемент = Элементы.КассирДляВхода Тогда
			ТекущийЭлемент = Элементы.КодКассира;
		ИначеЕсли ТекущийЭлемент = Элементы.КодКассира Тогда
			ОбработатьКомандуВойти();
		ИначеЕсли ТекущийЭлемент = Элементы.Войти Тогда
			ОбработатьКомандуВойти();
		ИначеЕсли ТекущийЭлемент = Элементы.ЗавершитьРаботу Тогда
			ОбработатьКомандуОтменитьВвод();
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискПоШтрихкоду(ШтрихкодПоиска)
	
	Если Не СокрЛП(ШтрихкодПоиска) = "" Тогда
		ВыполнитьПоискКассира(ШтрихкодПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискКассира(КодКассира)
	
	Если ИспользуетсяТорговыйОбъект И Не ЗначениеЗаполнено(ТорговыйОбъектДляВхода) Тогда
		ТекущийЭлемент = Элементы.ТорговыйОбъектДляВхода;
		ВывестиСообщениеОбОшибкеАвторизации("ПустойМагазин");
	Иначе
		
		ШтрихкодПоиска = СокрЛП(КодКассира);
		ИнтерфейсРМКСлужебныйКлиентСервер.ЗаменитьСимволGS1(ШтрихкодПоиска);
		ВозможныеНазначенияАвторизации = ИнтерфейсРМКСлужебныйКлиентСервер.НазначенияАвторизации();
		
		ФильтрПоискаПоШтрихкоду = Новый Структура;
		ФильтрПоискаПоШтрихкоду.Вставить("Пользователи");
		ФильтрПоискаПоШтрихкоду.Вставить("ФизическиеЛица");
		ФильтрПоискаПоШтрихкоду.Вставить("ИнформационныеКарты");
		ФильтрПоискаПоШтрихкоду.Вставить("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
		Если ЗначениеЗаполнено(КассирДляВхода) Тогда
			ФильтрПоискаПоШтрихкоду.Вставить("КассирДляВхода", КассирДляВхода);
		КонецЕсли;
		
		РеквизитыРМК = СтруктураРеквизитовРМКДляАвторизации();
		СтруктураПараметровКлиента = ДанныеПоискаПоШтрихкодуСерверБезКонтекста(ШтрихкодПоиска, РеквизитыРМК);
		ЭтоПовышениеПрав = (НазначениеАвторизации = ВозможныеНазначенияАвторизации.ПовышениеПрав
				Или НазначениеАвторизации = ВозможныеНазначенияАвторизации.СлужебныеДействияКСО);
		ИсключитьПользователейБезКассиров(НастроитьКассировДляВхода,
			СтруктураПараметровКлиента.ЗначенияПоиска, ЭтоПовышениеПрав);
		Если СтруктураПараметровКлиента.ЗначенияПоиска.Количество() > 0 Тогда
			
			Если СтруктураПараметровКлиента.ЗначенияПоиска.Количество() = 1 Тогда
				СтрокаРезультата = СтруктураПараметровКлиента.ЗначенияПоиска[0];
				ВернутьДанныеАвторизации(СтрокаРезультата);
			Иначе
				ОткрытаБлокирующаяФорма = Ложь;
				РаботаСоШтрихкодамиКлиентПереопределяемый.ОбработатьДанныеПоКоду(ЭтотОбъект, СтруктураПараметровКлиента,
					ОткрытаБлокирующаяФорма);
			КонецЕсли;
			
		Иначе
			
			ВывестиОшибкуАвторизации();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораДанныхПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		СтрокаРезультата = Результат.ЗначенияПоиска[0];
		ЗначенияПрошлогоПоиска = ДополнительныеПараметры.СтруктураПараметровКлиента.ЗначенияПоиска;
		СтрокаИзНабора = ПолучитьСтрокуИзПолногоСписка(ЗначенияПрошлогоПоиска, СтрокаРезультата.Владелец);
		Если СтрокаИзНабора = Неопределено Тогда
			СтрокаИзНабора = СтрокаРезультата;
		КонецЕсли;
		ВернутьДанныеАвторизации(СтрокаИзНабора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураРеквизитовРМКДляАвторизации()
	
	ИменаРеквизитовФормыРМК = ОбщегоНазначенияРМККлиент.ИменаРеквизитовФормыАвторизацииРМК();
	СтруктураРеквизитовФормыРМК = Новый Структура(ИменаРеквизитовФормыРМК);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитовФормыРМК, ЭтотОбъект, ИменаРеквизитовФормыРМК);
	
	Возврат СтруктураРеквизитовФормыРМК;
	
КонецФункции

&НаСервереБезКонтекста
Функция СуществуетКодАвторизацииУКассира(КассирДляПроверки, ДополнительныеПараметры)
	
	КодСуществует = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ОпределитьСуществованиеКодаУКассира(КассирДляПроверки, КодСуществует,
		ДополнительныеПараметры);
	
	Возврат КодСуществует;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПоискаПоШтрихкодуСерверБезКонтекста(Знач Штрихкод, Знач РеквизитыРМК)
	
	ДанныеШтрихкода = Новый Структура;
	РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, РеквизитыРМК, ДанныеШтрихкода);
	Возврат ДанныеШтрихкода;
	
КонецФункции

&НаКлиенте
Процедура ВывестиСообщениеОбОшибкеАвторизации(ТипОшибки)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипОшибки", ТипОшибки);
	СтандартнаяОбработка = Истина;
	
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	ШаблонСообщения = НСтр("ru = '%1'") + Символы.ПС + НСтр("ru = '%2'");
	СтрокаОшибка = НСтр("ru = ''");
	СтрокаДействие = НСтр("ru = ''");
	Если ТипОшибки = "ПустойМагазин" Тогда
		СтрокаОшибка = НСтр("ru = 'Не выбран торговый объект.'");
		СтрокаДействие = НСтр("ru = 'Выберите торговый объект.'");
	ИначеЕсли ТипОшибки = "НедостаточноПрав" Тогда
		СтрокаОшибка = НСтр("ru = 'Недостаточно прав.'");
		СтрокаДействие = НСтр("ru = 'Обратитесь к администратору.'");
	ИначеЕсли ТипОшибки = "ПустойКод" Тогда
		СтрокаОшибка = НСтр("ru = 'Не введен код сотрудника.'");
		СтрокаДействие = НСтр("ru = 'Введите код сотрудника.'");
	ИначеЕсли ТипОшибки = "НеУстановленКод" Тогда
		СтрокаОшибка = НСтр("ru = 'Выбранному кассиру не установлен код сотрудника.'");
		СтрокаДействие = НСтр("ru = 'Обратитесь к администратору.'");
	ИначеЕсли ТипОшибки = "НеВерныйКод" Тогда
		СтрокаОшибка = НСтр("ru = 'Введен неверный код сотрудника.'");
		СтрокаДействие = НСтр("ru = 'Обратитесь к администратору.'");
	ИначеЕсли ТипОшибки = "НеОпределенКассир" Тогда
		СтрокаОшибка = НСтр("ru = 'По коду сотрудника не определен кассир.'");
		СтрокаДействие = НСтр("ru = 'Обратитесь к администратору.'");
	Иначе
		СтрокаОшибка = НСтр("ru = 'Ошибка авторизации.'");
		СтрокаДействие = НСтр("ru = 'Обратитесь к администратору.'");
	КонецЕсли;
	
	СообщениеОбОшибке = СтрШаблон(ШаблонСообщения, СтрокаОшибка, СтрокаДействие);
	ПоказатьПредупреждение( ,СообщениеОбОшибке)
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если РежимКассыСамообслуживания Тогда
		Элементы.ДекорацияЗаголовокВводКассира.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокВводаКассираПриПовышенииПрав()
	
	НаправлениеОбращения = "";
	ЗаголовокВводКассира = "";
	НачалоЗаголовка = "";
	Если ЗначениеЗаполнено(НеобходимоеПраво) Тогда
		
		ТекстЗаменыПравДополнительный = НСтр("ru='Отсканируйте его персональный код или задействуйте магнитную карту'");
		
		Если ЗначениеЗаполнено(НаименованиеПользователяПриЗапросеПрав) Тогда
			НаправлениеОбращения = НаименованиеПользователяПриЗапросеПрав;
		Иначе
			НаправлениеОбращения = ?(РежимКассыСамообслуживания, НСтр("ru='сотруднику магазина'"), НСтр("ru='администратору'"));
		КонецЕсли;
		
		ЗаголовокВводКассира
			= СтрШаблон(НСтр("ru='Обратитесь к %1. %2'"), НаправлениеОбращения, ТекстЗаменыПравДополнительный);
		
		Элементы.ДекорацияЗаголовокВводКассира.Заголовок = ЗаголовокВводКассира;
		//Элементы.ДекорацияЗаголовокВводКассира.Высота = 3;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокВводаКассираДляДействийКСО()
	
	ЗаголовокВводКассира = НСтр("ru='Для открытия служебных операций требуется подтверждение сотрудника.'");
	Элементы.ДекорацияЗаголовокВводКассира.Заголовок = ЗаголовокВводКассира;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РежимОсновногоОкна = КлиентскоеПриложение.ПолучитьРежимОсновногоОкна();
	РежимПолногоОкна = (РежимОсновногоОкна = РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто
		Или РежимОсновногоОкна = РежимОсновногоОкнаКлиентскогоПриложения.Киоск
		Или ЭтоНачальноеОкноРядовогоПользователя());
		
	Если РежимВхода И РежимПолногоОкна И Не ИнтерактивноеЗакрытие Тогда
		
		Отказ = Истина;
		ЗапроситьПодтверждениеЗавершения();
		
	КонецЕсли;
	ИнтерактивноеЗакрытие = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьПодтверждениеЗавершения()
	
	КнопкиПродолжения = Новый СписокЗначений;
	КнопкиПродолжения.Добавить("ЗавершитьРаботу", НСтр("ru = 'Завершить работу'"));
	КнопкиПродолжения.Добавить("ПродолжитьРаботу", НСтр("ru = 'Продолжить работу'"));
	ЗаголовокВопроса = НСтр("ru = '1С: Рабочее место кассира'");
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ОбработатьОтветЗавершения", ЭтотОбъект);
	
	ПоказатьВопрос(ОповещениеЗакрытия, НСтр("ru = 'Завершить работу с приложением?'"), КнопкиПродолжения,,
		"ЗавершитьРаботу", ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветЗавершения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ЗавершитьРаботу" Тогда
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТипПоляВводаКассира()
	
	Если НастроитьКассировДляВхода Тогда
		
		НастроитьСписокВыбораКассировДляВхода();
		
	Иначе
		
		ОграничениеТипаКассира = ПолучитьОписаниеСправочногоТипаКассира();
		Если Не ОграничениеТипаКассира = Неопределено Тогда
			Элементы.КассирДляВхода.ВыбиратьТип = Ложь;
			Элементы.КассирДляВхода.ОграничениеТипа = ОграничениеТипаКассира;
			Элементы.КассирДляВхода.КнопкаВыпадающегоСписка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокВыбораКассировДляВхода()
	
	Элементы.КассирДляВхода.ВыбиратьТип = Ложь;
	Элементы.КассирДляВхода.РедактированиеТекста = Ложь;
	
	КассирыДляСписка = ОбщегоназначенияРМК.ПолучитьКассировДляВходаТекущегоПользователя();
	Если КассирыДляСписка.Количество() > 0 Тогда
		Элементы.КассирДляВхода.СписокВыбора.ЗагрузитьЗначения(КассирыДляСписка);
	КонецЕсли;
	
	Если (РежимВхода Или РежимСмены) И КассирыДляСписка.Количество() = 1 И Не ЗначениеЗаполнено(КассирДляВхода) Тогда
		КассирДляВхода = КассирыДляСписка[0];
	КонецЕсли;
	
	Элементы.КассирДляВхода.КнопкаВыпадающегоСписка = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеСправочногоТипаКассира()
	
	РезультатФункции = Неопределено;
	
	ТипВсеСправочники = Справочники.ТипВсеСсылки();
	НайденныеТипы = Новый Массив;
	
	ОписаниеТипаКассираРМК = Метаданные.ОпределяемыеТипы.КассирРМК;
	СоставТипов = ОписаниеТипаКассираРМК.Тип.Типы();
	КоличествоТипов = СоставТипов.Количество();
	КоличествоСправочниковВТипе = 0;
	ИндексТипа = 0;
	Пока ИндексТипа < КоличествоТипов И КоличествоСправочниковВТипе <= 1 Цикл
		ТекущийТип = СоставТипов.Получить(ИндексТипа);
		Если ТипВсеСправочники.СодержитТип(ТекущийТип) Тогда
			КоличествоСправочниковВТипе = КоличествоСправочниковВТипе + 1;
			НайденныеТипы.Добавить(ТекущийТип);
		КонецЕсли;
		
		ИндексТипа = ИндексТипа + 1;
	КонецЦикла;
	Если КоличествоСправочниковВТипе = 1 Тогда
		РезультатФункции = Новый ОписаниеТипов(НайденныеТипы);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьНеобходимыеДанныеКассира(НайденныйКассир, ЭтоПовышениеПрав)
	
	РезультатФункции = Ложь;
	
	Если Не НайденныйКассир = Неопределено Тогда
		Если ЗначениеЗаполнено(НайденныйКассир.Кассир) Тогда
			РезультатФункции = Истина;
		ИначеЕсли ЭтоПовышениеПрав Тогда
			РезультатФункции = (НайденныйКассир.Свойство("ПользовательБД") И ЗначениеЗаполнено(НайденныйКассир.ПользовательБД));
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти
